app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def show
    @category = Category.friendly.find params[:id]