app/controllers/reviews_controller.rb

  def create
    @review = @product.reviews.new review_params
    @review.user = current_user
    if @review.save
---
INSERT INTO "reviews" ("message", "product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["message", "hfjf"], ["product_id", 1], ["user_id", 2], ["created_at", "2015-03-19 00:03:24.592083"], ["updated_at", "2015-03-19 00:03:24.592083"]]

  def find_product
    @product = Product.find params[:product_id]
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]

  def find_review
    @review = Review.find params[:id]
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 1]]