app/views/categories/_list.html.haml

SELECT "categories".* FROM "categories"
---
      = link_to 'All', categories_path
    - Category.all.each do |category|