app/views/categories/show.html.haml

    - if @category.present? or @products.present?
      - @products = @category.products unless @products.present?
---
SELECT "products".* FROM "products" WHERE "products"."category_id" = ?  [["category_id", 1]]