app/views/products/_feedback.html.haml

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]
---
.list-group
  - @product.reviews.each do |review|